import code

print('העולם מתחלק ל 4 סגנונות מרכזיים: מנתח, מקדם, תומך ןמשימתי')
print("ולכל סגנון יש סגנון משנה\n"
      "השאלון שלפנייך בא לברר עבורך לאחזה סגנון הנך משתייך.\n"
      "ברוב השאלות התשובה היא גם וגם ולכן השאלה היא לא מה אתה,אלה מה אתה יותר\n"
      "שים ♥️ \n"
      "האבחון הינו אמיתי לחלוטין , מאת הגרפולוית הידועה: תהילה כרמל\n"
      "השאלון מחולק ל 2 חלקים כל חלק מכיל 15 שאלות")
print("לפנך יוצגו מספר שאלות")
print("באפשרותך לדחות את מענה התשובה על ידי הקשת:0\n"
      "אם ברצונך להציג את הבחירות עד כה,או לשנות תשובה הקש:3")
print("חלק ראשון/רשמי או בלתי רשמי")
# חלק 1
rishmiOrNot={1:("שיטתי","אקראי"),2:("מחושב","ספונטני"),3:("מאורגן","בלתי מאורגן"),4:("חוסם","מבטא"),
5:("מתמקד במשימה","מתמקד ביחס אנוש"),6:("בוחן ","אימפולסיבי"),7:("מאופק","מלא חיים"),8:("בשליטה עצמית ","ניחוח,משוחרר"),
9:("נוקשה","גמיש"),10:("מעונב","לא רשמי"),11:("שכלתני","רגשני"),12:("מתוח","רפוי"),13:("בלתי זמין","זמין"),
             14:("ממוקד","בלתי ממוקד"),15:("שגרתי","מאלתר")}
chooseing={1:"",2:"",3:"",4:"",5:"",6:"",7:"",8:"",9:"",10:"",11:"",12:"",13:"",14:"",15:""}
count=[0,0]
leth = []
index = 0


code.cheke(rishmiOrNot,chooseing,count,leth,index)
#print(chooseing,"finish1")
#print('leth',leth)

#print("חזרה לשאלות שעוד לא ענית")
while len(leth)>0:
    code.lastTime(rishmiOrNot, chooseing,count, leth, index)
    #print('leth', leth)

#print(count[0],count[1])
print("סימת את מענה השאלות של חלק 1, \n"
      "כעת יוצגו לפניך כל הבחירות של חלק זה ,בדוק אם אתה מעונין\n"
      "לשנות תשובה כל שהיא \n"
      "לשינוי תשובה הקש 2 למעבר לחלק הבא הקש: 0\n"
      "")
num=1
while(num!=0):
    code.choise3(rishmiOrNot, chooseing, count, leth, 15, index)
    num = input()
    num = code.costToInt(num)
#print("part1:",count[0],count[1])
print("הנך מועבר לחלק השני של השאלון")
print("חלק שני/פאסיבי או דומיננטי")
#print("part1:",count[0],count[1])
# חלק 2
pasivOrDomin={1:("מצטרף","לוקח פיקוד"),2:("מהסס","מוכן"),3:("מקבל בהבנה","מאתגר"),4:("מופנם","מוחצן"),5:("שקט","רועש"),
 6:("משלים","יזם"),7:("מקשיב","דברן"),8:("מאופק","דוחף"),9:("שואל שאלות","קובע עובדות"),10:("סמוי","גלוי"),11:("מסכים","מתווכח"),
12:("נשלט","משתלט"),13:("כבד","מזרז"),14:("מבליע","מבטא"),15:("נמנע","ניגש")}
chooseing2={1:"",2:"",3:"",4:"",5:"",6:"",7:"",8:"",9:"",10:"",11:"",12:"",13:"",14:"",15:""}
count2=[0,0]
leth2 = []
index2 = 0
print("חלק שני של האבחון")
code.cheke(pasivOrDomin,chooseing2,count2,leth2,index2)
#print(chooseing2,"finish2")
#print('leth',leth2)
#print("חזרה לשאלות שעוד לא ענית")
while len(leth)>0:
    code.lastTime(pasivOrDomin, chooseing2, count2, leth2, index2)
    # print(chooseing2,"finish2-----------")
    #print('leth', leth2)

print("סימת את מענה השאלות של חלק 2, \n"
      "כעת יוצגו לפניך כל הבחירות של חלק זה ,בדוק אם אתה מעונין\n"
      "לשנות תשובה כל שהיא \n"
      "לשינוי תשובה הקש 2 למעבר לתוצאות הקש: 0\n")
num=1
while(num!=0):
    code.choise3(pasivOrDomin, chooseing2, count2, leth2, 15, index2)
    num = input()
    num = code.costToInt(num)
#print("part1:",count2[0],count2[1])
###סיום: תוצאות####
print("סימת לענות על כל השאלות הנך מועבר לתוצאות")
x=count[0]-count[1]
y=count2[0]-count2[1]
#print(x,y)
code.calculation(x,y)
code.openFile()


